import 'dart:math';

import 'package:alajal_clock/reminder/reminder_data.dart';
import 'package:alajal_clock/reminder/reminder_item.dart';
import 'package:flutter/material.dart';

class Reminders extends StatefulWidget {
  const Reminders({super.key});

  @override
  State<Reminders> createState() => _RemindersState();
}

class _RemindersState extends State<Reminders> {
  final List<ReminderData> _reminders = [
    ReminderData('Remembrance', 'Did you remember me today?'),
    ReminderData('Desperation', 'Did you cry and pray for my return today?'),
    ReminderData('Gha\'ib',
        'Did you ponder over the fact that you can see all the creation, but not me? Does it bother you?\nعَزِيزٌ عَلَيَّ انْ ارَىٰ ٱلْخَلْقَ وَلاَ تُرَىٰ'),
    ReminderData('Muntaqim',
        'Did you ask God today "Where is the one who will avenge the blood of the martyrs of Karbala?"?'),
    ReminderData('Salutations',
        'Have you sent salutations on me today?\nاَلسَّلاَمُ عَلَيْكَ يَا حُجَّةَ ٱللَّهِ فِي ارْضِهِ. اَلسَّلاَمُ عَلَيْكَ يَا عَيْنَ ٱللَّهِ فِي خَلْقِهِ. اَلسَّلاَمُ عَلَيْكَ يَا نُورَ ٱللَّهِ. ٱلَّذِي يَهْتَدِي بِهِ ٱلْمُهْتَدُونَ. وَيُفَرَّجُ بِهِ عَنِ ٱلْمُؤْمِنِينَ. اَلسَّلاَمُ عَلَيْكَ ايُّهَا ٱلْمُهَذَّبُ ٱلْخَائِفُ. اَلسَّلاَمُ عَلَيْكَ ايُّهَا ٱلْوَلِيُّ ٱلنَّاصِحُ. اَلسَّلاَمُ عَلَيْكَ يَا سَفِينَةَ ٱلنَّجَاةِ. اَلسَّلاَمُ عَلَيْكَ يَا عَيْنَ ٱلْحَيَاةِ. اَلسَّلاَمُ عَلَيْكَ صَلَّىٰ ٱللَّهُ عَلَيْكَ وَعَلَىٰ آلِ بَيْتِكَ ٱلطَّيِّبينَ ٱلطَّاهِرِينَ. اَلسَّلاَمُ عَلَيْكَ عَجَّلَ ٱللَّهُ لَكَ مَا وَعَدَكَ مِنَ ٱلنَّصْرِ وَظُهُورِ ٱلامْرِ. اَلسَّلاَمُ عَلَيْكَ يَا مَوْلاَيَ انَا مَوْلاَكَ عَارِفٌ بِاولاَكَ وَاخْرَاكَ. اتَقَرَّبُ إِلَىٰ ٱللَّهِ تَعَالَىٰ بِكَ وَبِآلِ بَيْتِكَ. وَانْتَظِرُ ظُهُورَكَ وَظُهُورَ ٱلْحَقِّ عَلَىٰ يَدَيْكَ. وَاسْالُ ٱللَّهَ انْ يُصَلِّيَ عَلَىٰ مُحَمَّدٍ وَآلِ مُحَمَّدٍ. وَانْ يَجْعَلَنِي مِنَ ٱلمُنْتَظِرِينَ لَكَ. وَٱلتَّابِعِينَ وَٱلنَّاصِرِينَ لَكَ عَلَىٰ اعْدَائِكَ. وَٱلْمُسْتَشْهَدِينَ بَيْنَ يَدَيْكَ فِي جُمْلَةِ اوْلِيَائِكَ. يَا مَوْلاَيَ يَا صَاحِبَ ٱلزَّمَانِ صَلَوَاتُ ٱللَّهِ عَلَيْكَ وَعَلَىٰ آلِ بَيْتِكَ هٰذَا يَوْمُ ٱلْجُمُعَةِ وَهُوَ يَوْمُكَ ٱلْمُتَوَقَّعُ فِيهِ ظُهُورُكَ وَٱلْفَرَجُ فِيهِ لِلْمُؤْمِنِينَ عَلَىٰ يَدَيْكَ وَقَتْلُ ٱلْكَافِرِينَ بِسَيْفِكَ وَانَا يَا مَوْلاَيَ فِيهِ ضَيْفُكَ وَجَارُكَ وَانْتَ يَا مَوْلاَيَ كَرِيمٌ مِنْ اوْلاَدِ ٱلْكِرَامِ وَمَاْمُورٌ بِٱلضِّيَافَةِ وَٱلإِجَارَةِ فَاضِفْنِي وَاجِرْنِي صَلَوَاتُ ٱللَّهِ عَلَيْكَ وَعَلىٰ اهْلِ بَيْتِكَ ٱلطَّاهِرينَ'),
    ReminderData('Safety',
        'Have you recited dua for my safety?\nاللّهُمّ كُنْ لِوَلِيّكَ الحُجّةِ ابْنِ الحَسَنِ صَلَوَاتُكَ عَلَيْهِ وَعَلَى آبَائِهِ فِي هذِهِ السَّاعَةِ وَفي كُلّ سَاعَةٍ وَلِيّاً وَحَافِظاً وَقَائِداً وَنَاصِراً وَدَلِيلاً وَعَيْناً حَتَّى تُسْكِنَهُ أَرْضَكَ طَوْعاً وَتُمَتّعَهُ فِيهَا طَوِيلاً.'),
    ReminderData('Faraj',
        "Have you recited Dua-e-Faraj for me?\nإِلَهِيْ عَظُمَ الْبَلَاءُ وَبَرِحَ الْخَفَاءُ وَانْكَشَفَ الْغِطَاءُ وَانْقَطَعَ الرَّجَاءُ ، وَضَاقَتِ الْأَرْضُ وَمُنِعَتِ السَّمَاءُ وَأَنْتَ الْمُسْتَعَانُ وَإِلَيْكَ الْمُشْتَكَي وَ عَلَيْكَ الْمُعَوَّلُ فِيْ الشِّدَّةِ وَالرَّخَاءِ، اَللَّهُمَّ صَلِّ عَلَي مُحَمَّدٍ وَّآلِ مُحَمَّدٍ أُوْلِي الْأَمْرِ الَّذِيْنَ فَرَضْتَ عَلَيْنَا طَا عَتَهُمْ وَ عَرَّفْتَنَا بِذَالِكَ مَنْزِلَتَهُمْ ، فَفَّرِجْ عَنَّا بِحَقِّهِمْ فَرَجاً عَاجِلاً قَرِيْباً كَلَمْحِ الْبَصَرِ أَوْ هُوَ أَقْرَبُ يَامُحَمَّدُ يَاعَلِيُّ يَاعَلِيُّ يَامُحَمَّدُ كْفِيَانِيْ فَإِنَّكُمَا كَافِيَانِ وَ انْصُرَانِيْ فَإِنَّكُمَا نَاصِرَانِ يَامَوْلَانَا يَاصَاحِبَ الزَّمَانِ اَلْغَوْثَ اَلْغَوْثَ اَلْغَوْثَ أَدْرِكْنِيْ أَدْرِكْنِيْ أَدْرِكْنِيْ اَلسَّاعَةَ اَلسَّاعَةَ اَلسَّاعَةَ اَلْعَجَلَ اَلْعَجَلَ اَلْعَجَلَ يَا أَرْحَمَ لرَّاحِمِيْنَ بِحَقِّ مُحَمَّدٍ وَّآلِهِ الطَّا هِرِيْنَ"),
    ReminderData('The Allegiance',
        'Have you recently recited Dua-e-Ahad for me?\nاَللَّهُمَّ رَبَّ ٱلنُّورِ ٱلْعَظِيمِ. وَرَبَّ ٱلْكُرْسِيِّ ٱلرَّفِيعِ. وَرَبَّ ٱلْبَحْرِ ٱلْمَسْجُورِ. وَمُنْزِلَ ٱلتَّوْرَاةِ وَٱلإِنْجِيلِ وَٱلزَّبُورِ. وَرَبَّ ٱلظِّلِّ وَٱلْحَرُورِ. وَمُنْزِلَ ٱلْقُرْآنِ ٱلْعَظِيمِ. وَرَبَّ ٱلْمَلاَئِكَةِ ٱلْمُقَرَّبِينَ. وَٱلأَنْبِيَاءِ وَٱلْمُرْسَلِينَ. اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِٱسْمِكَ ٱلْكَرِيـمِ. وَبِنُورِ وَجْهِكَ ٱلْمُنِيرِ. وَمُلْكِكَ ٱلْقَدِيمِ. يَا حَيُّ يَا قَيُّومُ. أَسْأَلُكَ بِٱسْمِكَ ٱلَّذِي أَشْرَقَتْ بِهِ ٱلسَّمَاوَاتُ وَٱلأَرَضُونَ. وَبِٱسْمِكَ ٱلَّذِي يَصْلَحُ بِهِ ٱلأَوَّلُونَ وَٱلآخِرُونَ. يَا حَيّاً قَبْلَ كُلِّ حَيٍّ. وَيَا حَيّاً بَعْدَ كُلِّ حَيٍّ. وَيَا حَيّاً حِينَ لا حَيُّ يَا مُحْيِيَ ٱلْمَوْتَىٰ وَمُمِيتَ ٱلأَحْيَاءِ. يَا حَيُّ لا إِلٰهَ إِلاَّ أَنْتَ. اَللَّهُمَّ بَلِّغْ مَوْلاَنَا ٱلإِمَامَ ٱلْهَادِيَ ٱلْمَهْدِيَّ ٱلْقَائِمَ بِأَمْرِكَ. صَلَوَاتُ ٱللَّهِ عَلَيْهِ وَعَلَىٰ آبَائِهِ ٱلطَّاهِرِينَ. عَنْ جَمِيعِ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ. فِي مَشَارِقِ ٱلأَرْضِ وَمَغَارِبِهَا. سَهْلِهَا وَجَبَلِهَا وَبَرِّهَا وَبَحْرِهَا. وَعَنِّي وَعَنْ وَالِدَيَّ مِنَ ٱلصَّلَوَاتِ زِنَةَ عَرْشِ ٱللَّهِ. وَمِدَادَ كَلِمَاتِهِ. وَمَا أَحْصَاهُ عِلْمُهُ وَأَحَاطَ بِهِ كِتَابُهُ. اَللَّهُمَّ إِنِّي أُجَدِّدُ لَهُ فِي صَبِيحَةِ يَوْمِي هٰذَا. وَمَا عِشْتُ مِنْ أَيَّامِي. عَهْداً وَعَقْداً وَبَيْعَةً لَهُ فِي عُنُقِي. لا أَحُولُ عنها وَلا أَزُولُ أَبَداً. اَللَّهُمَّ ٱجْعَلْنِي مِنْ أَنْصَارِهِ وَأَعْوَانِهِ وَٱلذَّابِّينَ عَنْهُ وَٱلْمُسَارِعِينَ إِلَيْهِ فِي قَضَاءِ حَوَائِجِهِ وَٱلْمُمْتَثِلِينَ لأَوَامِرِهِ وَٱلْمُحَامِينَ عَنْهُ وَٱلسَّابِقِينَ إِلَىٰ إِرَادَتِهِ وَٱلْمُسْتَشْهَدِينَ بَيْنَ يَدَيْهِ. اَللَّهُمَّ إِنْ حَالَ بَيْنِي وَبَيْنَهُ ٱلْمَوْتُ ٱلَّذِي جَعَلْتَهُ عَلَىٰ عِبَادِكَ حَتْماً مَقْضِيّاً. فَأَخْرِجْنِي مِنْ قَبْرِي مُؤْتَزِراً كَفَنِي شَاهِراً سَيْفِي مُجَرِّداً قَنَاتِي مُلَبِّياً دَعْوَةَ ٱلدَّاعِي فِي ٱلْحَاضِرِ وَٱلْبَادِي. اَللَّهُمَّ أَرِنِي ٱلطَّلْعَةَ ٱلرَّشِيدَةَ وَٱلْغُرَّةَ ٱلْحَمِيدَةَ. وَٱكْحُلْ نَاظِرِي بِنَظْرَةٍ مِنِّي إِلَيْهِ. وَعَجِّلْ فَرَجَهُ. وَسَهِّلْ مَخْرَجَهُ. وَأَوْسِعْ مَنْهَجَهُ. وَٱسْلُكْ بِي مَحَجَّتَهُ. وَأَنْفِذْ أَمْرَهُ. وَٱشْدُدْ أَزْرَهُ. وَٱعْمُرِ ٱللَّهُمَّ بِهِ بِلادَكَ وَأَحْيِ بِهِ عِبَادَكَ. فَإِنَّكَ قُلْتَ وَقَوْلُكَ ٱلْحَقُّ:. «ظَهَرَ ٱلْفَسَادُ فِي ٱلْبَرِّ وَٱلْبَحْرِ بِمَا كَسَبَتْ أَيْدِي ٱلنَّاسِ.». فَأَظْهِرِ ٱللَّهُمَّ لَنَا وَلِيَّكَ وَٱبْنَ بِنْتِ نَبِيِّكَ ٱلْمُسَمَّىٰ بِٱسْمِ رَسُولِكَ صَلَّىٰ ٱللَّهُ عَلَيْهِ وَآلِهِ. حَتَّىٰ لا يَظْفَرَ بِشَيْءٍ مِنَ ٱلْبَاطِلِ إِلاَّ مَزَّقَهُ. وَيُحِقُّ ٱلْحَقَّ وَيُحَقِّقَهُ وَٱجْعَلْهُ. ٱللَّهُمَّ مَفْزَعاً لِمَظْلُومِ عِبَادِكَ. وَنَاصِراً لِمَنْ لا يَجِدُ لَهُ نَاصِراً غَيْرَكَ. وَمُجَدِّداً لِمَا عُطِّلَ مِنْ أَحْكَامِ كِتَابِكَ. وَمُشَيِّداً لِمَا وَرَدَ مِنْ أَعْلامِ دِينِكَ وَسُنَنِ نَبِيِّكَ صَلَّىٰ ٱللَّهُ عَلَيْهِ وآلِهِ وَٱجْعَلْهُ. ٱللَّهُمَّ مِمَّنْ حَصَّنْتَهُ مِنْ بَأُسِ ٱلْمُعْتَدِينَ. اَللَّهُمَّ وَسُرَّ نَبِيَّكَ مُحَمَّداً صَلَّىٰ ٱللَّهُ عَلَيْهِ وآلِهِ. بِرُؤْيَتِهِ وَمَنْ تَبِعَهُ عَلَىٰ دَعْوَتِهِ. وَٱرْحَمِ ٱسْتِكَانَتَنَا بَعْدَهُ. اَللَّهُمَّ ٱكْشِفْ هٰذِهِ ٱلْغُمَّةَ عَنْ هٰذِهِ ٱلأُمَّةِ بِحُضُورِهِ. وَعَجِّلْ لَنَا ظُهُورَهُ. «إِنَّهُمْ يَرَوْنَهُ بَعِيداً وَنَرَاهُ قَرِيباً.». بِرَحْمَتِكَ يَا أَرْحَمَ ٱلرَّاحِمِينَ. الْعَجَلَ ٱلْعَجَلَ يَامَوْلايَ يَا صَاحِبَ ٱلزَّمَانِ. الْعَجَلَ ٱلْعَجَلَ يَامَوْلايَ يَا صَاحِبَ ٱلزَّمَانِ. الْعَجَلَ ٱلْعَجَلَ يَامَوْلايَ يَا صَاحِبَ ٱلزَّمَانِ')
  ];

  @override
  Widget build(BuildContext context) {
    double randomVal = Random().nextDouble() * _reminders.length;

    return Scaffold(
        backgroundColor: Colors.transparent,
        body: _reminders.isEmpty
            ? getEmptyListWidget()
            : Column(
                mainAxisAlignment: MainAxisAlignment.spaceBetween,
                crossAxisAlignment: CrossAxisAlignment.start,
                children: [
                  ReminderItem(
                    data: _reminders[randomVal.toInt()],
                  ),
                  Center(
                    child: GestureDetector(
                      onTap: () => setState(() {
                        _reminders.clear();
                      }),
                      child: const Icon(
                        Icons.done_outline_rounded,
                        color: Colors.green,
                        size: 64,
                      ),
                    ),
                  ),
                ],
              ));
  }

  Widget getEmptyListWidget() {
    return const Center(
      child: Column(
        mainAxisAlignment: MainAxisAlignment.center,
        crossAxisAlignment: CrossAxisAlignment.center,
        children: [
          Icon(
            Icons.mark_email_read_rounded,
            color: Colors.green,
            size: 64,
          ),
          Text('No new messages from Imam e Zamana (ajtf)')
        ],
      ),
    );
  }
}
